{
  "symptom2id": {
    "1_minute_is_like_clockwork_on_the_shutdown.": 0,
    "60_coming_back_and_55_going_out_on_the_last_shutdown._setpoint_45.": 1,
    "ac_is_toast": 2,
    "all_zones_heat_somewhat_when_only_one_is_calling_and_valves_are_locked_open": 3,
    "bad_connection_in_molex_plug": 4,
    "blank_thermostat_call": 5,
    "blower_motor_able_to_change_speeds": 6,
    "blower_motor_constantly_running": 7,
    "blower_motor_not_stopping_when_unit_off_or_reached_temp": 8,
    "blown_fuse_implied_by_bypass": 9,
    "broken_flexible_gas_line": 10,
    "burning_smell": 11,
    "cannot_clear_fault_code": 12,
    "chiller_failure": 13,
    "chiller_shuts_down_on_no_flow": 14,
    "circuit_1_would_start_5_minutes_pull_down_timer_circuit_2_would_start_1_minute_no_flow._same_if_circuit_2_comes_on_first.": 15,
    "clogged_drain": 16,
    "clogged_flue_pipe": 17,
    "clogged_inducer": 18,
    "communication_error": 19,
    "compressor_failure": 20,
    "compressor_needs_replacement": 21,
    "compressor_starving_for_oil_potential": 22,
    "compressor_trips_needs_reset_daily": 23,
    "crack_in_heat_exchanger": 24,
    "cracked_heat_exchanger": 25,
    "cracked_heat_exchangers": 26,
    "damaged_blower_wheel": 27,
    "damper_running_wrong_direction": 28,
    "dangerous_wiring": 29,
    "dead_transformer": 30,
    "dirty_evaporator_coil": 31,
    "discoloration_on_heat_exchanger": 32,
    "draft_bouncing_around_-.43_to_-.55_\"wc": 33,
    "draft_dipping_to_-.13\"": 34,
    "evaporator_heaters_not_working": 35,
    "evaporator_heaters_not_working_implied": 36,
    "excessive_service_loop_in_lineset": 37,
    "exposed_wiring": 38,
    "flames_widening_and_narrowing": 39,
    "flow_drops_to_almost_0_on_flow_switch_when_second_compressor_starts": 40,
    "frozen_drain_pan": 41,
    "fucked_low_voltage_job": 42,
    "furnace_not_turning_up_to_second_stage": 43,
    "fuse_bypassed_with_wire": 44,
    "gas_valve_chattered": 45,
    "gas_valve_clicking_on_off": 46,
    "gas_valve_gave_up": 47,
    "gas_valve_overfeeding_gas": 48,
    "heat_exchanger_replacement": 49,
    "heat_pump_pumps_down_in_heat": 50,
    "heaters_leaking": 51,
    "high_temperature_discharge": 52,
    "improper_installation": 53,
    "incorrectly_installed_barometric_damper": 54,
    "incorrectly_oriented_phases_rectified": 55,
    "inducer_motor_not_increasing_speed_in_second_stage": 56,
    "insulation_touching_terminal_block": 57,
    "just_the_thermal_flow_switch._gauges_don't_move_and_pump_never_slows_down.": 58,
    "messy_wiring": 59,
    "motor_failed": 60,
    "needs_heat_exchanger": 61,
    "no_attempt_to_spark_from_spark_pilot": 62,
    "no_heat": 63,
    "noisy_pump": 64,
    "non-responsive_zone_valve": 65,
    "outdoor_txv_sensing_bulb_disconnected": 66,
    "outdoor_unit_won't_come_on": 67,
    "potential_oil_traps": 68,
    "pressure_switch_fault": 69,
    "pressure_switch_issue": 70,
    "pressure_switch_not_staying_closed": 71,
    "pressure_switch_wiring_issue": 72,
    "primary_drain_clogged": 73,
    "reduced_airflow": 74,
    "reduced_performance_due_to_poor_condenser_placement": 75,
    "rust_emanating_from_said_dark_line": 76,
    "second_pressure_switch_clicking_on_off": 77,
    "severe_flame_rollout": 78,
    "shot_inducer": 79,
    "smelled_gas": 80,
    "smoke_fog_discharge": 81,
    "something_bouncing_inside_pump": 82,
    "sparks": 83,
    "split_in_heat_exchanger_dimple": 84,
    "ss2_tripped": 85,
    "system_not_starting": 86,
    "t.stat_wire_catches_on_the_line": 87,
    "thermostat_doesn't_detect_system": 88,
    "unit_filled_with_water": 89,
    "unit_goes_into_heat_intermittently": 90,
    "unit_running_at_marginal_pressure": 91,
    "wires_melting": 92
  },
  "system_type2id": {
    "<unk_system_type>": 0
  },
  "subtype2id": {
    "<unk_subtype>": 0
  },
  "brand2id": {
    "<unk_brand>": 0,
    "carrier": 1,
    "daikin": 2,
    "goodman": 3,
    "honeywell": 4,
    "lennox": 5,
    "nordyne": 6,
    "rheem": 7,
    "rudd": 8,
    "taco": 9,
    "tempstar": 10,
    "trane": 11
  },
  "diag2id": {
    "dx.airflow_restriction_or_ice": 0,
    "dx.compressor_or_valve_fault": 1,
    "dx.condensate_overflow_or_switch": 2,
    "dx.control_open_or_short": 3,
    "dx.controls_board_or_comm": 4,
    "dx.electrical_low_voltage_chain": 5,
    "dx.fuel_delivery_or_burner_tuning": 6,
    "dx.heat_exchanger_failure": 7,
    "dx.install_or_wiring_issue": 8,
    "dx.mechanical_drive_or_bearing": 9,
    "dx.other_or_unclear": 10,
    "dx.sensor_or_safety_fault": 11
  },
  "version": 1
}