{
  "symptom2id": {
    "0.48_mohms_to_ground": 0,
    "0_flow": 1,
    "12_inches_of_plenum_before_a_t-split_to_two_branch_ducts": 2,
    "14_minute_freeze_cycle": 3,
    "1_degree_liquid_line_temp_drop": 4,
    "1_degree_liquid_line_temp_drop_at_775_psi": 5,
    "1_degree_sh_difference": 6,
    "1_degree_sh_difference_at_775_psi": 7,
    "3d_split": 8,
    "4000ppm_co": 9,
    "4_leaks": 10,
    "4_red_flashes_then_a_green_flash": 11,
    "60_psi_cold_with_the_bypass_open": 12,
    "7_volts_from_y_to_ground_on_the_thermostat_wire": 13,
    "8_out_of_17_burners_were_melted": 14,
    "a_tube_that_just_pulled_out": 15,
    "abnormal_discharge_superheat_80_degrees": 16,
    "abnormal_liquid_temperature_84_degrees": 17,
    "abnormal_running_pressures_60_220": 18,
    "abnormal_subcooling_25_degrees": 19,
    "abnormal_suction_superheat_50_degrees": 20,
    "abnormal_suction_temperature_34_degrees": 21,
    "ac_and_heat_ran_at_the_same_time": 22,
    "ac_freezing_up": 23,
    "ac_wasn't_working": 24,
    "acting_as_if_no_refrigerant": 25,
    "adjustment_screw_stripped_out": 26,
    "air_assembly_moving_freely": 27,
    "air_conditioner_doesn't_work": 28,
    "air_conditioning_is_broken": 29,
    "air_conditioning_is_broken_in_terminal_4": 30,
    "air_escaping_from_line": 31,
    "air_filter_dirty": 32,
    "air_filter_installed_backwards": 33,
    "air_handler_cabinet_sweating": 34,
    "air_lock_suspected": 35,
    "air_pockets_in_system": 36,
    "air_pressure_making_its_way_into_the_hx": 37,
    "airflow_is_good": 38,
    "airflow_issues": 39,
    "airflow_issues_due_to_damper": 40,
    "alarm_under_compressor_status": 41,
    "all_burners_were_cracked": 42,
    "all_temp_sensors_and_transducers_check_out": 43,
    "all_the_controls_after_showing_low_or_0_voltage": 44,
    "all_zones_\"somewhat\"_heat_when_only_one_is_calling_and_valves_locked_open": 45,
    "amps_slowly_climbed_up_from_6-14_before_it_petered_out": 46,
    "app_cannot_maintain_network_connection": 47,
    "app_recognizes_unit_but_no_clickable_interface": 48,
    "app_says_it\u2019s_connected_but_can\u2019t_control_anything": 49,
    "aquastat_over_fire_boilers": 50,
    "aquastat_set_to_160\u00b0_low_limit_despite_not_having_domestic_coil": 51,
    "auto_feeder_once": 52,
    "awful_smell": 53,
    "bad_35uf_run_cap": 54,
    "bad_board": 55,
    "bad_bulbs": 56,
    "bad_connection": 57,
    "bad_evaporator_motor": 58,
    "bad_heat_exchanger": 59,
    "bad_ignition_control_module": 60,
    "bad_pressure_gauge": 61,
    "bad_regulator": 62,
    "bad_relay_for_hsi": 63,
    "bad_smell": 64,
    "bad_transformer": 65,
    "ballast_failures": 66,
    "basement_not_warm_enough": 67,
    "bearing_seized": 68,
    "blank_thermostat_call": 69,
    "blocked_airflow": 70,
    "blocked_vent": 71,
    "blower_fan_went_on_the_unit": 72,
    "blower_motor_dead": 73,
    "blower_motor_is_cooked": 74,
    "blower_motor_went_out": 75,
    "blower_motor_will_not_kick_on": 76,
    "blower_not_operating": 77,
    "blower_not_working": 78,
    "blower_running_indoor_unit": 79,
    "blower_shaft_broken_failed": 80,
    "blower_wheel_damaged": 81,
    "blower_wheel_dirty": 82,
    "blown_fuse": 83,
    "blows_cold_air_when_put_to_heat": 84,
    "board_reports_pressure_switch_open_when_closed": 85,
    "board_was_still_saying_pressure_switch_open_when_it_was_closed": 86,
    "boiler_coming_on_and_off_outside_of_heating_season": 87,
    "boiler_explosion": 88,
    "boiler_not_firing": 89,
    "boiler_went_boom": 90,
    "bolts_loose_on_back_of_heat_exchanger": 91,
    "bolts_off": 92,
    "both_primary_drain_ports_were_completely_closed": 93,
    "bracket_damaged": 94,
    "breached_heat_exchanger": 95,
    "breaker_tripping_on_transformer": 96,
    "broken_aluminum_piece": 97,
    "broken_flexible_gas_line": 98,
    "broken_missing_belt": 99,
    "bubbling_out_of_the_fitting_because_the_hose_was_clogged_instantly": 100,
    "bug_pinned_in_contactor": 101,
    "building_pressure_off": 102,
    "built-in_and_bms_loop_temperature_sensors_confirm_readings_within_0.5_degrees.": 103,
    "burned_motor_windings": 104,
    "burner_cycles_on_and_off_non_stop": 105,
    "burner_didn't_light": 106,
    "burners_light_but_don't_hit_the_flame_sensor": 107,
    "burning_dirty": 108,
    "burning_dirty_on_low_fire": 109,
    "burnt_king_valve": 110,
    "burnt_windings": 111,
    "burnt_windings_burned_between_9_and_11": 112,
    "burnt_wires_and_plugs": 113,
    "burny_electric_smell": 114,
    "bypassed_disconnect": 115,
    "bypassing": 116,
    "call_backs": 117,
    "cap_is_the_only_thing_that_seals_it": 118,
    "capacitor_needs_replacement": 119,
    "capacitors_tested_fine": 120,
    "carbon_monoxide_exposure": 121,
    "carbon_monoxide_risk": 122,
    "carnage_in_combustion_chamber": 123,
    "catastrophic_compressor_failure": 124,
    "changing_out_gaskets": 125,
    "chilled_water_return_temperature_degf_60_supply_temperature_degf_55_with_a_setpoint_of_degf_45_.": 126,
    "chiller_failure": 127,
    "chiller_is_down": 128,
    "chiller_line_that_feeds_terminal_4_broke": 129,
    "chiller_water_inlet_pipe_burst": 130,
    "chillers_in_alarm_for_bearing_fault": 131,
    "chillers_in_alarm_for_high_pressure": 132,
    "chunks_of_ice": 133,
    "chw_flow_lost": 134,
    "city_water_pressure_running_in_there_caused_the_expansion_tanks_to_go_bad": 135,
    "clogged_air_filter": 136,
    "clogged_blower_wheel": 137,
    "clogged_charging_hose": 138,
    "clogged_condensate_drain": 139,
    "clogged_drain": 140,
    "clogged_drain_line": 141,
    "clogged_drain_lines": 142,
    "clogged_drains": 143,
    "clogging_drain_lines": 144,
    "closed_dampers_during_call_for_cool": 145,
    "closed_vents": 146,
    "co_26_ppm_initially_drops_to_13_ppm_when_blower_off": 147,
    "co_tests_with_holes_in_the_hx_came_back_clean": 148,
    "coil_leak": 149,
    "coil_replacement_needed": 150,
    "coil_sensor_failure": 151,
    "coil_too_tall": 152,
    "coil_tripping_cb1": 153,
    "coils_pushed_in": 154,
    "collapsed_air_filter": 155,
    "communication_failure": 156,
    "communication_loss": 157,
    "completely_blocked_return_duct": 158,
    "completely_charred_the_inside_of_the_furnace": 159,
    "compressor_bad": 160,
    "compressor_blew_a_pin": 161,
    "compressor_blew_a_pin_electrical_terminals": 162,
    "compressor_bolt_missing_improperly_installed": 163,
    "compressor_burn_marks": 164,
    "compressor_destruction_anticipated": 165,
    "compressor_failure": 166,
    "compressor_lockout_alarm": 167,
    "compressor_not_engaging": 168,
    "compressor_not_running_even_when_manually_engaged": 169,
    "compressor_overcurrent_protection": 170,
    "compressor_overheating": 171,
    "compressor_pulling_amp_4_low": 172,
    "compressor_scroll_rotating_in_reverse": 173,
    "compressor_short_cycling": 174,
    "compressor_shuts_off_after_1.5_seconds": 175,
    "compressor_struggling_to_move": 176,
    "compressor_too_loud": 177,
    "compressor_took_a_shit": 178,
    "compressor_tripping_on_high_motor_current": 179,
    "compressor_tripping_on_thermal_overload": 180,
    "compressor_trips_needs_reset": 181,
    "compressor_trips_on_high_differential_pressure_across_oil_filter": 182,
    "compressor_trips_on_low_oil_level": 183,
    "compressor_vibration": 184,
    "compressor_was_running": 185,
    "compressor_will_not_kick_on": 186,
    "compressor_will_not_run": 187,
    "compressor_will_not_run_in_heat_mode": 188,
    "compressor_wire_was_also_hooked_into_that_7.5_cap": 189,
    "compressors_called_bad_when_not": 190,
    "compressors_off_on_oil_fail": 191,
    "compressors_still_isn't_pumping_refrigerant": 192,
    "compressors_weren't_pumping_refrigerant": 193,
    "compressors_won't_run": 194,
    "condensate_line_leak": 195,
    "condensate_pump_issues": 196,
    "condenser_coil_damaged": 197,
    "condenser_coil_dirty": 198,
    "condenser_fan_motor_failure_blew_terminal_off": 199,
    "condenser_fan_motor_fell_off_mount": 200,
    "condenser_fan_motor_has_a_bit_of_vibration": 201,
    "condenser_not_running": 202,
    "condenser_not_turning_on": 203,
    "condenser_still_calling_on_after_bypassing_purge": 204,
    "condenser_unit_covered_in_ice": 205,
    "confirmed_pressure_switch_was_closed_with_the_inducer_running_and_still_no_volt_120_to_hsi": 206,
    "constant_issues_with_boards": 207,
    "contactor_chatter": 208,
    "contactor_issue": 209,
    "contaminant_felt_like_solid_plastic_inside_the_hose": 210,
    "contaminant_had_consistency_of_hard_styrofoam_instantly_when_it_came_foaming_out": 211,
    "contaminant_hardened_right_away": 212,
    "continually_enabling_heating_when_oat_ambient_is_low": 213,
    "continuity_across_all_terminals_besides_c_w1_and_w2": 214,
    "control_board_fried": 215,
    "control_board_malfunction": 216,
    "control_board_powers_down_and_reboots_during_ignition_process": 217,
    "control_short": 218,
    "cooler_not_working": 219,
    "cooling_tower_basin_levels_low": 220,
    "corrosion": 221,
    "could_not_get_superheat_below_20_without_subcooling_going_to_25": 222,
    "could_see_the_flames_inside": 223,
    "crack_in_bolt_hole": 224,
    "crack_in_heat_exchanger": 225,
    "crack_on_discharge_line": 226,
    "cracked_bulb": 227,
    "cracked_burners": 228,
    "cracked_heat_exchanger": 229,
    "cracked_heat_exchangers": 230,
    "cracks": 231,
    "crazy_high_discharge_pressures": 232,
    "crushed_ductwork": 233,
    "cutting_the_y_circuit": 234,
    "cycling_on_low_flame_signal": 235,
    "daikin_confirmed_flow_sensor_orientation_dot_direction_is_correct.": 236,
    "daikin_technician_installed_and_calibrated_the_new_flow_sensor.": 237,
    "damage": 238,
    "damaged_duct_boot": 239,
    "damaged_electrical_terminals": 240,
    "damaged_low_voltage_wiring": 241,
    "damper_installed_wrong_direction": 242,
    "dangerous_wiring": 243,
    "dark_line_in_a_unique_location": 244,
    "dead_animal_under_return_duct": 245,
    "dead_mice_in_intake": 246,
    "dead_transformer": 247,
    "debris_on_coil": 248,
    "defective_control_board": 249,
    "defrost_sensor_in_the_condenser_failure": 250,
    "degraded_uv_resistant_tape": 251,
    "detached_flue_pipe": 252,
    "detached_heat_exchanger_rivet": 253,
    "didn't_use_pipe_dope_or_anything": 254,
    "difficult_access_for_repair": 255,
    "difficulty_diagnosing": 256,
    "difficulty_getting_error_codes": 257,
    "dirt_debris_buildup": 258,
    "dirty_a-coils": 259,
    "dirty_air_filters_causing_reduced_airflow": 260,
    "dirty_coil_blower_wheel": 261,
    "dirty_evaporator_coil": 262,
    "dirty_evaporator_coils": 263,
    "dirty_flame_sensor": 264,
    "dirty_outdoor_coil": 265,
    "discharge_leak": 266,
    "discharge_pressure_14.3_bar_@_50%_capacity": 267,
    "discharge_pressure_14.4_bar": 268,
    "discharge_refrigerant_to_fcu_but_no_liquid_back": 269,
    "discharge_temp_98_deg_c": 270,
    "discoloration": 271,
    "disconnected_wire": 272,
    "display_says_'ice_not_wash'": 273,
    "does_not_have_a_flue": 274,
    "doesn't_connect_via_app_website": 275,
    "doesn't_even_stay_on_for_a_second_almost_reaches_the_flame_sensor_but_never_hits_it_before_e125": 276,
    "door_blew_off_the_front": 277,
    "doors_are_sometimes_completely_closed": 278,
    "doors_won't_open": 279,
    "double_blink_diagnostic_mode_on_rtrm": 280,
    "draft_near_neutral": 281,
    "draft_went_to_0": 282,
    "drafting_issues": 283,
    "drain_line_issues": 284,
    "drain_line_prone_to_blockage": 285,
    "drain_pan_filling_up": 286,
    "drain_pan_going_to_melt": 287,
    "drops_ice_then_back_to_wash": 288,
    "ductwork_dripping": 289,
    "ear_piercing_noise": 290,
    "ecm_control_module_failure": 291,
    "ecm_motor_failure": 292,
    "economizing_fault": 293,
    "eev_intermittently_locking": 294,
    "electric_water_heater": 295,
    "electrical_hazard": 296,
    "electrical_issue_24_getting_baked_into_120": 297,
    "electrical_shock": 298,
    "electrocution_of_snake": 299,
    "engages_stage_2_as_if_it_was_a_variable_speed_blower_motor": 300,
    "equipment_not_running": 301,
    "error_code_e7": 302,
    "error_messages_of_excessively_long_run_times": 303,
    "evaporator_coil_leak": 304,
    "even_when_i_would_suck_the_pressure_switch_closed_with_my_mouth_with_the_wires_on_i_still_wouldn\u2019t_get_volt_120_to_the_hsi": 305,
    "excessive_oil_consumption": 306,
    "excessive_service_loop_oil_trap_risk": 307,
    "existing_goop_repair_made_2_years_ago": 308,
    "expansion_tanks_failed_with_pinhole_leaks": 309,
    "expected_suction_pressure_4_bar_at_proper_operation": 310,
    "exposed_chewed_up_wires_in_the_whip_shorting_out_low_voltage": 311,
    "extreme_difference_in_temp_between_floors": 312,
    "extremely_dirty_filter": 313,
    "eyelet_fallen_off": 314,
    "failed_compressor": 315,
    "failed_heat_exchanger": 316,
    "failed_ignition_lockout_reason": 317,
    "failed_reversing_valve": 318,
    "failed_secondary_heat_exchanger": 319,
    "failed_txv": 320,
    "failed_weld": 321,
    "failing_bladders": 322,
    "family_of_dead_mice_along_with_the_nest_they_made_inside_the_intake": 323,
    "fan_loose": 324,
    "fan_motor_failure": 325,
    "fan_motor_went_bad": 326,
    "fan_ramps_up_too_high": 327,
    "fan_randomly_runs": 328,
    "fan_rubbing": 329,
    "fan_wouldn't_come_on_with_heat": 330,
    "fans_going_crazy": 331,
    "fans_won't_spin": 332,
    "fault_code_persists": 333,
    "faulting_after_power_cycle": 334,
    "faulty_gas_valve_initial_misdiagnosis": 335,
    "figured_out_what_was_wrong_with_it": 336,
    "filters_in_wrong": 337,
    "filthy_evaporator": 338,
    "finicky_air_adjustment": 339,
    "firing_rate_never_goes_above_20%": 340,
    "flame_blow_back": 341,
    "flame_plate_insulation_falling_off": 342,
    "flame_rolling_out_of_panel_holes": 343,
    "flames_are_visibly_lazy": 344,
    "flames_coming_out_of_water_heaters": 345,
    "flames_rolling_out": 346,
    "flames_widening_and_narrowing": 347,
    "flare_would_not_take": 348,
    "flashing_led_on_rtrm_board": 349,
    "flex_condensate_leaking": 350,
    "float_switch_felt_weird": 351,
    "float_switch_in_wrong_position": 352,
    "float_switch_tripping_due_to_condensate_backup": 353,
    "flow_drops_to_almost_0": 354,
    "flow_sensor_cable_was_replaced_with_the_sensor.": 355,
    "flue_pipe_blockage": 356,
    "freeze_protection_fault": 357,
    "freezing_moisture_anticipated": 358,
    "freezing_up": 359,
    "frost_on_lines": 360,
    "frosting_at_the_site_of_the_restriction": 361,
    "frozen_drain_pan": 362,
    "frozen_evaporator_coils": 363,
    "fuel_leak": 364,
    "furnace_flue_vented_indoors": 365,
    "furnace_goes_out_on_limit": 366,
    "furnace_has_a_constant_communication_error_blink": 367,
    "furnace_immediately_trips": 368,
    "furnace_isn't_working": 369,
    "furnace_kept_running_then_kicked_itself_out": 370,
    "furnace_locked_out_on_high_limit": 371,
    "furnace_not_reaching_second_stage": 372,
    "furnace_tripped_the_roll_out_switch": 373,
    "furnace_tripping_on_high_limit": 374,
    "furnace_won't_ignite": 375,
    "furnace_wouldn't_turn_on": 376,
    "fuse_bypassed_with_wire": 377,
    "fuse_popped_after_thermostat_wires_were_wire_nutted_at_the_outdoor_unit": 378,
    "fuses_bypassed": 379,
    "gas_line_connected_to_regulator_adjustment_port": 380,
    "gas_meter_locked_out": 381,
    "gas_meter_locked_out_due_to_unpaid_bill_by_previous_tenant": 382,
    "gas_pressure_0.8\"_on_low_fire_should_be_3.5\"": 383,
    "gas_pressure_2.5\"_on_high_fire_should_be_3.5\"": 384,
    "gas_smell": 385,
    "gas_smell_in_building": 386,
    "gas_valve_chattered": 387,
    "gas_valve_cycling_clicking_on_off": 388,
    "gas_valve_does_not_de-energize_lock_out": 389,
    "gas_valve_energized_with_no_flame": 390,
    "gas_valve_failure": 391,
    "gas_valve_gave_up": 392,
    "gas_valve_leaking": 393,
    "gas_valve_not_opening": 394,
    "gas_valve_outlet_pressure_remained_flat_at_-.35_in_w.c._before_and_after_energizing_no_high_spike_of_-.8_to_-3.0_in_w.c._as_per_manual": 395,
    "gas_valve_wasn't_reacting": 396,
    "gas_valves_leaking_by": 397,
    "gasket_blew_out_with_some_pressure": 398,
    "gasket_is_all_mushed_and_nasty_looking": 399,
    "gets_cold_on_the_main_floor": 400,
    "glycol_contamination": 401,
    "goes_into_cleaning_mode_unexpectedly": 402,
    "goes_into_lockout": 403,
    "green_communication_light_on_outdoor_unit": 404,
    "grooming_room_downstairs_was_being_straight_filled_with_natural_gas": 405,
    "grossly_overcharged_refrigerant": 406,
    "hairline_crack_atleast_half_way_around": 407,
    "half_its_charge_will_be_gone_again_after_6_months": 408,
    "harmonic_sound": 409,
    "head_kept_climbing_at_a_steady_rate_10_psi_sec": 410,
    "head_kept_climbing_at_a_steady_rate_10_psi_sec_topping_775_psi": 411,
    "headache": 412,
    "heat_exchanger_blowing_back": 413,
    "heat_exchanger_buildup": 414,
    "heat_exchanger_clogging": 415,
    "heat_exchanger_confirmed_not_cracked_by_manometer_test": 416,
    "heat_exchanger_cracked_and_failed": 417,
    "heat_exchanger_failure": 418,
    "heat_exchanger_had_cracks_on_every_cell": 419,
    "heat_exchanger_replacement": 420,
    "heat_from_vent": 421,
    "heat_pump_heating_active_but_nothing_turns_on": 422,
    "heat_transfer_issue_due_to_oil_carryover": 423,
    "heater_contactor_burned_up": 424,
    "heater_not_wired_in": 425,
    "heavy_compressors_220lbs_each": 426,
    "hex_nut_got_dropped_inside": 427,
    "high_ctoa_60\u00b0": 428,
    "high_current_spike": 429,
    "high_draft_pressure": 430,
    "high_draft_pressure_exhaust_pipe_draft_0.12": 431,
    "high_excess_air": 432,
    "high_excess_air_102%": 433,
    "high_head_pressure": 434,
    "high_head_pressure_500-600_psi": 435,
    "high_head_pressure_700psi": 436,
    "high_head_pressure_topping_775_psi": 437,
    "high_inducer_speed": 438,
    "high_limit_failed": 439,
    "high_limit_lockouts_anticipated": 440,
    "high_limit_tripping": 441,
    "high_liquid_line_pressure": 442,
    "high_motor_temps_200_229": 443,
    "high_motor_temps_200_229_125": 444,
    "high_o2": 445,
    "high_o2_10.59%_initially_drops_to_9.4%_when_blower_off": 446,
    "high_o2_on_low_fire": 447,
    "high_off_pressures": 448,
    "high_pressure_cut_off_fault": 449,
    "high_pressure_on_both_circuits": 450,
    "high_pressure_switch_failed": 451,
    "high_pressure_switch_tripped": 452,
    "high_return_static_pressure": 453,
    "high_side_not_high_enough": 454,
    "high_subcooling": 455,
    "high_suction": 456,
    "high_suction_pressure": 457,
    "high_superheat": 458,
    "high_temp_alarm": 459,
    "high_temperature_alarm": 460,
    "holding_29hg_vacuum": 461,
    "holes_in_heat_exchanger": 462,
    "horrendous_noise_on_start_up": 463,
    "horrible_start_up": 464,
    "hoses_were_clogged": 465,
    "hot_as_shit": 466,
    "house_foggy_smoke_combustion_issue": 467,
    "howling_noise_from_fan": 468,
    "humidifier_not_wired_causing_condensation": 469,
    "humidifier_not_working": 470,
    "humidity_usually_stays_around_48%_-_54%": 471,
    "ice_build_up": 472,
    "ice_cannot_be_broken_up": 473,
    "ice_sticking_to_plate": 474,
    "iced-up_refrigeration_coil": 475,
    "iced_over_coil": 476,
    "iced_system": 477,
    "icing_up_at_coil": 478,
    "impeded_water_flow": 479,
    "improper_coil_installation": 480,
    "improper_combustion": 481,
    "improper_condensate_drain_installation": 482,
    "improper_gas_line_connection": 483,
    "improper_installation": 484,
    "improper_pressure_differential": 485,
    "improper_system_replacement_combi_boiler_replaced_with_electric_water_heater_for_hydronic_heat": 486,
    "improper_wiring_in_disconnect": 487,
    "improperly_spliced_thermostat_wire_causing_a_fuse_to_pop": 488,
    "inability_to_connect_to_control_board_via_app": 489,
    "inadequate_voltage": 490,
    "incomplete_combustion_caused_the_soot": 491,
    "incorrect_board_for_setup": 492,
    "incorrect_component_installation_water_coil_with_refrigeration_condenser": 493,
    "incorrect_component_installed": 494,
    "incorrect_sheaves": 495,
    "incorrect_wiring": 496,
    "incorrect_wiring_3_circulators_only_2_wired_to_new_panel_other_circ_wired_to_aquastat_end_switches_from_panel_to_tt_on_aquastat": 497,
    "incorrect_wiring_gauge": 498,
    "incorrectly_installed_safety_switch": 499,
    "indicator_light_doesn't_switch_to_red_in_heat_mode_stays_blue": 500,
    "indoor_filter_coil_is_clean": 501,
    "inducer_cracked": 502,
    "inducer_full_of_water": 503,
    "inducer_motor_never_increased_its_amp_draw": 504,
    "inducer_motor_steady_on": 505,
    "inducer_motor_stuck_in_first_stage": 506,
    "inducer_motor_voltage_abnormality": 507,
    "inducer_not_increasing_speed_for_second_stage": 508,
    "inducer_pulling_-1.6_pressure": 509,
    "inefficient_vacuum_pulling": 510,
    "insulation_degraded": 511,
    "insulation_flapping_and_touching_terminal_block": 512,
    "intermittent_blower_issue": 513,
    "intermittent_firing": 514,
    "intermittent_heating": 515,
    "intermittent_ignition": 516,
    "intermittent_malfunction": 517,
    "inverted_oil_trap": 518,
    "inverter_board_failure": 519,
    "ir_remote_signal_interference": 520,
    "isolated_to_compressor": 521,
    "issue_occurs_on_both_circuits_circuit_1_starts_5-minute_pull_down_circuit_2_starts_1_minute_later_'no_flow'_shutdown._same_sequence_if_circuit_2_starts_first.": 522,
    "issues": 523,
    "kinda_tastes_like_cancer\u2026_feels_like_plastic_and_crumbles": 524,
    "kinked_line": 525,
    "kinked_line_set": 526,
    "lack_of_identifiers_in_metric_od_id_confusion": 527,
    "lead_lag_pumps_tried_individually_and_together_with_no_change.": 528,
    "leak": 529,
    "leak_at_pressure_switch_where_wires_come_out_of_housing": 530,
    "leak_at_the_indoor_coil": 531,
    "leak_from_evaporator_coil": 532,
    "leak_from_one_of_the_suction_line_brazing_point": 533,
    "leak_in_the_terminal_block_gasket": 534,
    "leak_on_the_cap_nut_on_a_txv": 535,
    "leak_on_the_low_side_service_valve": 536,
    "leaking_at_the_orifice": 537,
    "leaking_heaters": 538,
    "leaking_valve_cores": 539,
    "leaking_valve_stems": 540,
    "leaks": 541,
    "leaks_corrosion_in_line_set": 542,
    "leaks_in_both_coils": 543,
    "leaks_on_top_on_the_block": 544,
    "left_side_rollout_wouldn't_reset": 545,
    "lift_point_failure": 546,
    "liquid_line_temperature_130.8": 547,
    "liquid_line_with_crazy_random_dips": 548,
    "liquid_refrigerant_to_fcu_but_no_cooling": 549,
    "liquid_slugging": 550,
    "liquid_tight_conduit_cut_through_control_wires_due_to_improper_termination": 551,
    "located_in_a_factory_that_opens_and_closes_semi-truck_loading_doors_all_day": 552,
    "locked_up_motor": 553,
    "loose_schrader_core": 554,
    "losing_control_voltage": 555,
    "losing_pressure_during_test": 556,
    "losing_refrigerant": 557,
    "lost_about_10_psi_during_pressure_test": 558,
    "lost_all_r22": 559,
    "lost_charge": 560,
    "lost_oil": 561,
    "lost_refrigerant_charge": 562,
    "loud_noise_like_a_jet_engine": 563,
    "low-voltage_control_wire_inside_seal-tight_filled_with_water_and_shorted_out_due_to_corrosion": 564,
    "low_airflow": 565,
    "low_amp_draw": 566,
    "low_amps_5._amp_6_on_16._amp_7_rla": 567,
    "low_charge": 568,
    "low_co2": 569,
    "low_co2_5.80%": 570,
    "low_co2_on_low_fire": 571,
    "low_combustion_suction": 572,
    "low_compression_readings": 573,
    "low_evaporator_saturation_temperature": 574,
    "low_exhaust_pressure": 575,
    "low_fire_adjustment_stripped_out": 576,
    "low_flash_tank_level": 577,
    "low_head_pressure": 578,
    "low_limits_set_on_brand_new_equipment": 579,
    "low_no_secondary_voltage_from_transformer": 580,
    "low_oil": 581,
    "low_oil_level_in_sight_glass": 582,
    "low_on_charge": 583,
    "low_on_freon": 584,
    "low_on_refrigerant": 585,
    "low_refrigerant_fault": 586,
    "low_return_air_temperature": 587,
    "low_side_not_low_enough": 588,
    "low_subcooling": 589,
    "low_superheat": 590,
    "low_voltage_issue_volt_24_feed_to_contactor": 591,
    "low_voltage_short": 592,
    "low_voltage_wiring_hit_by_weed_eater_and_poorly_reconnected": 593,
    "lowboy_control_went_out": 594,
    "lower_contact_oxidized": 595,
    "lowish_fluctuating_pressures": 596,
    "lwco_has_been_replaced_twice": 597,
    "magic_smoke_out": 598,
    "main_panels_blew_fuses": 599,
    "makeshift_drain_line": 600,
    "makeshift_fan_replacement": 601,
    "makeup_water_prv_not_feeding": 602,
    "making_a_few_clicks_and_such_but_nothing_happens": 603,
    "making_a_racket_like_the_bearings_are_done_probably_just_races_instead_of_bearings_but_whatever": 604,
    "manual_left_on_heat_kit": 605,
    "melted_burners": 606,
    "messy_wiring": 607,
    "metal_bent": 608,
    "micro_leaks": 609,
    "missing_coil_covers": 610,
    "missing_coils": 611,
    "missing_condenser": 612,
    "missing_economizer": 613,
    "missing_gas_meter___improper_meter_setup": 614,
    "mode_indicator_light_doesn't_switch_to_red_in_heat_mode": 615,
    "motor_blowing_constantly_regardless_of_thermostat_settings": 616,
    "motor_damaged": 617,
    "motor_did_not_stop_to_spin_when_unit_was_off_or_reached_temp": 618,
    "motor_failed": 619,
    "motor_goes_to_second_speed_after_a_couple_of_seconds": 620,
    "motor_makes_noise_as_if_it_wants_to_speed_up": 621,
    "motor_not_running_correctly": 622,
    "motor_replacement_needed": 623,
    "mud_dauber_nest": 624,
    "mud_dauber_nest_in_flue": 625,
    "multiple_high_pressure_trips": 626,
    "mystery_noise": 627,
    "natural_gas_smell": 628,
    "needs_capacitor_replacement": 629,
    "needs_contactor_replacement": 630,
    "needs_heat_exchanger": 631,
    "needs_temp_sensor_replacement": 632,
    "negligible_drafts": 633,
    "never_got_to_the_ignitor_step_of_ignition": 634,
    "never_vacuumed": 635,
    "new_thermostat_won't_perform_any_function": 636,
    "nicked_the_copper": 637,
    "nitrogen_going_into_condenser_during_pressure_test": 638,
    "no_ac": 639,
    "no_air": 640,
    "no_attempt_to_spark_from_spark_pilot": 641,
    "no_blower": 642,
    "no_bubble_test_performed": 643,
    "no_bubbles_in_sight_glass_@_90%": 644,
    "no_cold_air_coming_from_vents": 645,
    "no_common_hooked_up": 646,
    "no_continuity_between_any_of_the_thermostat_wires": 647,
    "no_cool": 648,
    "no_cooling": 649,
    "no_cooling_calls_for_the_room": 650,
    "no_detectable_leaks_with_d-tek_stratus": 651,
    "no_drain_hole_in_pan": 652,
    "no_drain_pan": 653,
    "no_excess_vibration": 654,
    "no_exhaust_outlet_or_anything": 655,
    "no_filter": 656,
    "no_filter_for_8_years": 657,
    "no_flame": 658,
    "no_flame_present": 659,
    "no_funky_smell_from_gas": 660,
    "no_gas_flow": 661,
    "no_gas_supply_gas_meter_locked": 662,
    "no_heat": 663,
    "no_heat_call": 664,
    "no_heating": 665,
    "no_other_gas_appliances": 666,
    "no_overload_lp_or_hp_lockout": 667,
    "no_piston_at_all_in_the_air_handler": 668,
    "no_power_at_disconnect": 669,
    "no_power_coming_to_the_blowers_low_terminal_of_the_board": 670,
    "no_trap": 671,
    "no_volt_120_to_hsi": 672,
    "no_volt_24_at_thermostat": 673,
    "no_way_of_running_at_higher_capacity": 674,
    "noise_when_cooling_cycles_compressor_on_off": 675,
    "noisy_operation": 676,
    "noisy_pump": 677,
    "non-condensables": 678,
    "non-responsive_taco_valves": 679,
    "non_condensables_in_system": 680,
    "not_circulating_to_the_furthest_zone_very_good": 681,
    "not_cooling": 682,
    "not_getting_any_water_to_it": 683,
    "not_getting_much_heat": 684,
    "not_heating": 685,
    "not_pre-charge_implying_incorrect_charge_or_installation": 686,
    "noticeable_vibration": 687,
    "o2%_in_the_flue_was_climbing": 688,
    "o2_and_co_levels_change_significantly_when_blower_power_is_cycled_decrease_when_blower_off_increase_when_blower_on": 689,
    "o2_rise_of_1%_is_acceptable": 690,
    "obstruction_in_intake_pipe": 691,
    "occurs_after_a_couple_minutes_of_running": 692,
    "occurs_at_night_on_ac_when_outside_temperature_is_around_40_degrees_fahrenheit": 693,
    "oil_carryover_issue": 694,
    "oil_coming_out_orange_when_i_run_it": 695,
    "oil_everywhere_after_removing_plugs": 696,
    "oil_filter_is_dark_wet_dark": 697,
    "oil_goes_to_evaporator_and_not_coming_back": 698,
    "oil_leakage": 699,
    "oil_level_isn\u2019t_equal_in_the_compressors_site_glass": 700,
    "oil_line_from_evaporator_to_eductor_block_was_50%_closed": 701,
    "oil_lost": 702,
    "oil_on_line_set": 703,
    "oil_pouring_out_of_the_discharge_line": 704,
    "oil_stop_loss_alarm": 705,
    "oil_sump_looks_empty": 706,
    "oil_trapping": 707,
    "one_compressor_had_almost_twice_the_amount_of_oil_as_the_other": 708,
    "one_passage_probably_partially_blocked": 709,
    "one_passage_removed_from_service": 710,
    "only_the_thermal_flow_switch_indicates_zero_flow": 711,
    "open_rollout": 712,
    "operational_failed": 713,
    "orange_flame": 714,
    "orange_flame_on_the_right_side_of_the_burner_box": 715,
    "outdoor_communication_fault": 716,
    "outdoor_unit_doesn't_drop_temps_to_become_cold_evap_temps": 717,
    "outdoor_unit_still_won\u2019t_come_on": 718,
    "outdoor_unit_stolen": 719,
    "outside_air_temperature_30_deg_c": 720,
    "over_aired": 721,
    "over_heating_the_room": 722,
    "overcharged": 723,
    "overcharged_refrigerant": 724,
    "overflowing_drain_pan": 725,
    "overheated_temp_sensor_trips": 726,
    "overheating_issue": 727,
    "paper_thin_tube_with_several_leaks": 728,
    "parts_replaced_unnecessarily": 729,
    "parts_to_change_out": 730,
    "passed_pressure_test_and_triple_evac_without_giving_any_signs_of_leak": 731,
    "physical_damage_to_outdoor_unit": 732,
    "physical_damage_tree": 733,
    "physical_gauges_do_not_move_and_the_pump_speed_does_not_decrease.": 734,
    "plate_isn't_harvesting_correctly": 735,
    "plc_enables_heating_without_dat_control": 736,
    "plenum_too_short": 737,
    "plug_is_not_connected_or_dirty": 738,
    "plugged_condenser_coils": 739,
    "plugged_eev": 740,
    "plugged_osa_filters": 741,
    "plugged_regular_filters": 742,
    "poor_airflow": 743,
    "poor_brazing_technique": 744,
    "poor_ductwork": 745,
    "poor_ductwork_installation": 746,
    "poor_oil_return": 747,
    "poorly_brazed_line_set": 748,
    "poorly_installed_condensate_drain": 749,
    "poorly_installed_line_set": 750,
    "poorly_installed_refrigerant_lines": 751,
    "poorly_spliced_thermostat_wires": 752,
    "popped_another_fuse": 753,
    "popping_breaker": 754,
    "popping_fuse": 755,
    "possible_insufficient_airflow": 756,
    "potential_bad_heat_exchanger": 757,
    "potential_carbon_monoxide_leak": 758,
    "potential_coil_rupture_explosion": 759,
    "potential_compressor_failure": 760,
    "potential_cracked_heat_exchanger": 761,
    "potential_drain_pan_overflow": 762,
    "potential_flooding": 763,
    "potential_gas_leak_smell": 764,
    "potential_leak": 765,
    "potential_overcharged": 766,
    "power_cord_type_issue": 767,
    "premature_compressor_failure": 768,
    "pressure_drop_during_pressure_test_10-15psi": 769,
    "pressure_dropped_to_500_psig_with_water_on_the_coil": 770,
    "pressure_gauges_are_new_swapped_and_show_similar_readings.": 771,
    "pressure_reducing_valve_bypass_fully_opened": 772,
    "pressure_relief_opened": 773,
    "pressure_stays_on_under_a_second": 774,
    "pressure_switch_change_out": 775,
    "pressure_switch_code": 776,
    "pressure_switch_cycling_clicking_on_off": 777,
    "pressure_switch_did_close_every_time_the_inducer_motor_ran": 778,
    "pressure_switch_fault": 779,
    "pressure_switch_issue": 780,
    "pressure_switch_not_closing_as_reported_by_board": 781,
    "pressure_switch_was_open_before_a_call_for_heat": 782,
    "pressures_aren't_quite_right": 783,
    "pressures_were_130_and_310_before_it_quit": 784,
    "previously_frozen": 785,
    "primary_was_clogged": 786,
    "problem_connecting_wifi_interface": 787,
    "process_interrupted": 788,
    "protection_module_prevents_startup": 789,
    "psi_not_getting_below_115_before_shut_off": 790,
    "pulsating": 791,
    "pulsing_on_j6-6_to_j6-9_indicating_test_mode": 792,
    "pump_down_failing": 793,
    "pump_may_be_destroyed": 794,
    "pump_pressures": 795,
    "pump_repair": 796,
    "pumps_are_on_vfds_but_set_to_a_constant_100%_speed.": 797,
    "pumps_down_in_heat": 798,
    "punctured_pipe": 799,
    "quiet_and_weak_sounding": 800,
    "r_was_just_broken_off_of_the_fan_center_terminal": 801,
    "rattling_sound_from_liquid_line": 802,
    "recovered_some_of_the_charge_and_got_subcooling_down_to_16_with_superheat_at_21": 803,
    "refrigerant_contamination": 804,
    "refrigerant_leak": 805,
    "refrigerant_leak_apparent_during_test": 806,
    "refrigerant_leak_implied": 807,
    "refrigerant_leak_implied_by_200_psi_standing_pressure": 808,
    "refrigerant_leak_implied_by_leak_checking": 809,
    "refrigerant_leak_pressure_wouldn't_hold": 810,
    "refrigerant_lines_not_coiled_in_ceiling": 811,
    "refrigerant_loss": 812,
    "refrigerant_traveling_through_insulation_of_wire": 813,
    "relief_valve_clamped_shut": 814,
    "relief_valve_popping_at_20_psi": 815,
    "rental_property_with_new_tenant": 816,
    "repairs_on_the_estimate": 817,
    "repeated_txv_failures": 818,
    "restricted_airflow": 819,
    "restricted_airflow_implied": 820,
    "restriction_in_evap._coil": 821,
    "risk_of_accidental_arson_during_repair_due_to_tight_space": 822,
    "roasts_indoor_occupants": 823,
    "rollout_switch_tripping": 824,
    "rollouts_tripped": 825,
    "room_not_conditioning_properly": 826,
    "rtu_not_working": 827,
    "rubbing": 828,
    "running_60_psi_water_pressure_directly_in": 829,
    "running_in_heat_mode_on_80_degree_day": 830,
    "running_the_unit_reads_.6_to_.7_inwc": 831,
    "runs_for_15-20_minutes_before_tripping": 832,
    "rust": 833,
    "rust_emanating_from_said_dark_line": 834,
    "rust_on_heat_exchanger": 835,
    "rusted_duct_boot": 836,
    "rusted_out_rings": 837,
    "rusted_shut_relief_valve": 838,
    "safeties_not_tripping": 839,
    "same_error_keeps_showing_up": 840,
    "sc_below_10": 841,
    "scale_buildup": 842,
    "scary_wasted": 843,
    "screen_blank_intermittently": 844,
    "second_compressor_comes_on_it_runs_for_about_a_minute_then_shuts_down": 845,
    "second_stage_heat_not_coming_on": 846,
    "secondary_drain_spills_into_emergency_drain_pan": 847,
    "secondary_heat_exchanger_failure": 848,
    "secondary_heat_exchanger_is_plugged": 849,
    "seized_motor": 850,
    "seized_relief_valves": 851,
    "sensor_error": 852,
    "sensor_fault": 853,
    "service_errors": 854,
    "severe_oil_leakage_gusher": 855,
    "severely_clogged_filter": 856,
    "severely_worn_blower_motor_shaft": 857,
    "shaking_like_a_rabid_chihuahua": 858,
    "shooting_water_from_air_vent_and_boiler_drain_when_it_cooled": 859,
    "short_cycling_on_high_pressure": 860,
    "short_in_communication_wire": 861,
    "shot_inducer": 862,
    "shuts_down_on_no_flow": 863,
    "sight_glass_can_corrode": 864,
    "sight_glass_clouded_up_from_powdery_stuff_instantly": 865,
    "sight_glass_not_green_or_yellow": 866,
    "significant_mold_growth_on_mini_split_wheels": 867,
    "slinging_water_inside": 868,
    "slow_leak": 869,
    "small_occasional_flame_roll_out": 870,
    "small_shock_from_touching_r_terminal": 871,
    "smell": 872,
    "smelled_burning_wood": 873,
    "smelled_gas": 874,
    "smelled_ozone": 875,
    "smells_gas_from_flue": 876,
    "soft_stop": 877,
    "solenoid_needs_replacing": 878,
    "solenoid_valve_blew_out": 879,
    "solenoid_valve_burned_up": 880,
    "solid_constant_spark": 881,
    "solid_shaft": 882,
    "solids_in_the_charging_hose": 883,
    "something_was_bouncing_around_inside": 884,
    "sometimes_as_much_as_8_degrees_f_hotter": 885,
    "sometimes_lights_but_goes_out": 886,
    "soot_buildup_on_the_burners": 887,
    "sooted_up_furnace": 888,
    "spade_connection_loose": 889,
    "spark_ignition_wire_disconnected": 890,
    "spark_ignition_wire_was_visibly_arcing": 891,
    "sparks": 892,
    "sparks_from_blower_wheel": 893,
    "split_in_heat_exchanger_dimple": 894,
    "sputter_and_stop_plugged_into_extension_cord": 895,
    "stat_fuse_was_blown_potential": 896,
    "stat_wire_buried_in_the_rocks": 897,
    "stat_wire_going_to_the_ac_unit": 898,
    "static_is_out_of_wack_due_to_shit_ductwork": 899,
    "static_pressure_0.75_inwc_0.33_supply_0.42_return": 900,
    "steam_humidifier_not_working": 901,
    "stepper_motor_failed": 902,
    "strain_on_blower_motor": 903,
    "strainers_are_checked_and_clean.": 904,
    "structural_failure": 905,
    "struggle_with_the_room_temperature_staying_under_69_degrees": 906,
    "stuck_bearing_on_shaft": 907,
    "stuck_broken_radiator_bleeders": 908,
    "stuck_fan_blade": 909,
    "subcooling_being_on_the_low_side": 910,
    "subcooling_was_lower_prior_to_charging": 911,
    "suction_drops_below_2_bar_@_50%_capacity": 912,
    "suction_drops_below_2_bar_at_50%_capacity": 913,
    "suction_is_very_low_2.7_bar_at_50%_capacity": 914,
    "suction_line_frosting": 915,
    "suction_line_temp_prior_to_charge_was_63": 916,
    "suction_line_temp_sensor_improper_ohms_reading": 917,
    "suction_line_temperature_89.6": 918,
    "suction_pressure_2.8_bar": 919,
    "suction_pressure_2.8_bar_@_50%_capacity": 920,
    "suction_pressure_drops": 921,
    "suction_pressure_fluctuating_107-113_psig": 922,
    "suction_temp_+17_deg_c": 923,
    "super_cold_lines": 924,
    "superheat_dropping_some_then_subcooling_rising": 925,
    "superheat_of_about_13_degrees": 926,
    "superheat_sh_32.9": 927,
    "supply_temperature_will_rise_to_80_degrees_during_dehumidification": 928,
    "suspected_leak": 929,
    "swollen_and_burned_capacitor": 930,
    "system_failure": 931,
    "system_locked_out": 932,
    "system_locks_out": 933,
    "system_non-operational": 934,
    "system_not_starting": 935,
    "system_not_working": 936,
    "system_running_in_cooling_mode_when_heat_is_desired": 937,
    "system_trips_on_low_suction_at_75%_capacity": 938,
    "system_uses_water.": 939,
    "system_was_low_on_charge": 940,
    "t.stat_wire_would_catch_on_the_line_moving_up_or_down": 941,
    "tandem_compressor_set": 942,
    "temperature_increase_across_liquid_line_filter_drier": 943,
    "terrible_temperature_imbalance": 944,
    "thermostat_blank": 945,
    "thermostat_doesn\u2019t_detect_the_system": 946,
    "thermostat_needs_reset": 947,
    "thermostat_not_detecting_outdoor_unit": 948,
    "thermostat_overriding_customer_commands": 949,
    "throwing_196_code_condensate_issue": 950,
    "tiny_backyards_with_shared_access_being_used_by_neighbors": 951,
    "too_rich_of_a_mixture_to_ignite": 952,
    "top_cover_missing": 953,
    "traphouse_operating_next_door": 954,
    "trip_the_limits": 955,
    "tripping_limit": 956,
    "tripping_on_high_head": 957,
    "tripping_the_ss2": 958,
    "tvs_being_turned_on_off_by_ductless_remote": 959,
    "txv_malfunction": 960,
    "txv_replacement": 961,
    "txv_sensing_bulb_disconnected": 962,
    "undersized_12-inch_flex_return_ducts": 963,
    "unequal_oil_levels_in_compressors": 964,
    "uneven_heating": 965,
    "unidentified_thermostat_wires": 966,
    "unit_always_hot": 967,
    "unit_damaged_by_storm": 968,
    "unit_down": 969,
    "unit_failure": 970,
    "unit_filled_with_water": 971,
    "unit_fired_when_pieces_were_being_taken_off_the_box": 972,
    "unit_flooded": 973,
    "unit_is_40_years_old": 974,
    "unit_never_started": 975,
    "unit_not_going_through_sequence_of_operation": 976,
    "unit_not_starting_due_to_unplugged_ignition_module": 977,
    "unit_off_at_disconnect": 978,
    "unit_pumping_down_in_heat_mode": 979,
    "unit_rewired_once_implies_previous_electrical_issues": 980,
    "unit_shipped_with_wrong_compressor": 981,
    "unit_shuts_off": 982,
    "unit_stuck_in_test_mode": 983,
    "unit_was_replaced": 984,
    "unit_won't_ignite": 985,
    "units_not_in_good_shape": 986,
    "unlabeled_thermostat_wires": 987,
    "unusual_capacitor_wiring": 988,
    "unusual_compressor_shutdown_noise": 989,
    "unusual_growth_on_coil": 990,
    "unusual_noise": 991,
    "unusual_odor": 992,
    "unusual_vibration_shaking": 993,
    "upstairs_typically_3-4_degrees_f_hotter_than_the_first_floor": 994,
    "vacuum_leveled_off_at_650_microns": 995,
    "vacuum_pulled_down_to_382_microns_in_15_minutes_and_held_for_10_minute_decay_test": 996,
    "vacuum_pump_smoky": 997,
    "valve_handle_blocked": 998,
    "valve_isn\u2019t_closing_all_the_way": 999,
    "valves_in_terrible_shape": 1000,
    "vapor_saturation_drops": 1001,
    "vent_after_the_trap": 1002,
    "ventless_safety_operational_concern_with_flue_gases": 1003,
    "very_high_suction_pressures": 1004,
    "vfd_not_communicating": 1005,
    "vfds_pending_replacement": 1006,
    "volt_120_uv_light_one_line_hooked_up_to_the_breaker_and_the_other_to_ground": 1007,
    "volt_24_detected_at_coil_but_no_engagement": 1008,
    "voltage_abnormality_at_gas_valve": 1009,
    "voltage_drop_from_volt_27_to_volt_22": 1010,
    "voltage_from_r_to_the_cabinet": 1011,
    "voltage_problem_at_inducer_board": 1012,
    "wall_gave_way_due_to_massive_suction_pressure": 1013,
    "warehouse_unit_heater_was_broken": 1014,
    "wasp_nest_in_flue": 1015,
    "water_damage_from_above": 1016,
    "water_got_in_the_plug": 1017,
    "water_in_heat_exchanger": 1018,
    "water_in_inducer_motor": 1019,
    "water_leaking": 1020,
    "water_temp_at_degf_125": 1021,
    "water_will_overflow_the_furnace_trap": 1022,
    "weak_airflow": 1023,
    "weak_compressor": 1024,
    "weak_draft": 1025,
    "weak_flame": 1026,
    "weak_pump": 1027,
    "weak_spark": 1028,
    "weird_pressures": 1029,
    "weld_did_not_make_it_off_the_truck": 1030,
    "went_out_on_low_pressure": 1031,
    "wet_insulation_around_the_pipe": 1032,
    "wild_headaches": 1033,
    "will_try_to_light_but_immediately_go_out": 1034,
    "windings_on_coil_got_very_hot": 1035,
    "windings_shorted_to_solenoid_itself": 1036,
    "wine_cooler_needs_repair": 1037,
    "wire_from_one_of_the_pressure_switches_is_shitty_in_the_plug": 1038,
    "wire_rubbed_insulation_away": 1039,
    "wire_rubbed_out": 1040,
    "wire_was_'snatched'_out_the_tstat": 1041,
    "wires_are_off": 1042,
    "worn_bearings": 1043,
    "wouldn't_pass_a_pressure_test": 1044,
    "wrong_bx_belt": 1045,
    "wrong_drain_pan_connected": 1046,
    "wrong_nozzles": 1047,
    "wrong_sheaves": 1048,
    "zone_might_get_a_little_heat": 1049,
    "zoning_system_misconfigured": 1050
  },
  "system_type2id": {
    "<unk_system_type>": 0,
    "boiler_hydronic": 1,
    "chiller_ahu_system": 2,
    "commercial_rtu": 3,
    "ductless_mini_split": 4,
    "other_or_unclear": 5,
    "residential_furnace": 6,
    "residential_heat_pump": 7,
    "residential_split_ac": 8,
    "vrf_system": 9,
    "water_source_heat_pump": 10
  },
  "subtype2id": {
    "<unk_subtype>": 0
  },
  "brand2id": {
    "<unk_brand>": 0,
    "aaon": 1,
    "american_standard": 2,
    "apco": 3,
    "bard": 4,
    "beckett": 5,
    "bitzer": 6,
    "bryant": 7,
    "burnham": 8,
    "camus": 9,
    "carlyle": 10,
    "carrier": 11,
    "climatemaster": 12,
    "coleman": 13,
    "copeland": 14,
    "cps": 15,
    "crown": 16,
    "daikin": 17,
    "danfoss": 18,
    "emerson": 19,
    "fieldpiece": 20,
    "first_co": 21,
    "goodman": 22,
    "gree": 23,
    "greenheck": 24,
    "hallmark": 25,
    "heil": 26,
    "hisense": 27,
    "honeywell": 28,
    "hussmann": 29,
    "ice_o_matic": 30,
    "icp": 31,
    "infinity": 32,
    "intelipack": 33,
    "isopolar": 34,
    "jb": 35,
    "ke2": 36,
    "keeprite": 37,
    "laars": 38,
    "lb_white": 39,
    "lennox": 40,
    "lenox": 41,
    "lg": 42,
    "liebert": 43,
    "lochinvar": 44,
    "luxaire": 45,
    "manitowoc": 46,
    "maytag": 47,
    "midea": 48,
    "mitsubishi": 49,
    "mitsubishi_electric": 50,
    "modine": 51,
    "navien": 52,
    "nordyne": 53,
    "olimpia_splendid": 54,
    "opteon,_trane,_honeywell": 55,
    "paragon": 56,
    "rbi": 57,
    "refcomp": 58,
    "rheem": 59,
    "robur": 60,
    "rudd": 61,
    "ruud": 62,
    "samsung": 63,
    "spinnaker": 64,
    "srp": 65,
    "stoelting": 66,
    "taco": 67,
    "tatco": 68,
    "tempstar": 69,
    "trane": 70,
    "trane/american_standard": 71,
    "uponor": 72,
    "weather_king_(rheem_rebranded)": 73,
    "weil_mclain": 74,
    "white_rodgers": 75,
    "william's": 76,
    "york": 77
  },
  "diag2id": {
    "dx.blocked_flue_or_chimney": 0,
    "dx.blower_motor_failure_or_fan_not_running": 1,
    "dx.blower_or_fan_motor_shorted_burned_out": 2,
    "dx.blower_running_wrong_speed_or_clogged_wheel": 3,
    "dx.blown_fuse_or_tripped_breaker": 4,
    "dx.clogged_dirty_air_filter": 5,
    "dx.communication_failure": 6,
    "dx.compressor_internal_failure_mechanical_valve": 7,
    "dx.compressor_not_starting_electrical_problem": 8,
    "dx.compressor_or_fan_contactor_failed": 9,
    "dx.condensate_overflow_float_switch_triggered": 10,
    "dx.condenser_fan_motor_failure": 11,
    "dx.condenser_fan_not_at_full_speed": 12,
    "dx.control_board_failure_or_fault": 13,
    "dx.control_transformer_failure_no_24v": 14,
    "dx.cooling_disabled_or_heat_on": 15,
    "dx.cracked_heat_exchanger": 16,
    "dx.dirty_or_blocked_condenser_coil": 17,
    "dx.dirty_or_clogged_burners": 18,
    "dx.dirty_or_clogged_evaporator_coil": 19,
    "dx.draft_inducer_motor_failure": 20,
    "dx.electric_heat_strips_not_working": 21,
    "dx.failed_start_or_run_capacitor": 22,
    "dx.faulty_pressure_sensor_or_switch": 23,
    "dx.faulty_temperature_sensor": 24,
    "dx.filter_drier_or_capillary_tube_restriction": 25,
    "dx.flame_sensor_dirty_or_failed": 26,
    "dx.furnace_pressure_switch_failed_or_tubing_blocked": 27,
    "dx.gas_valve_not_opening_or_gas_supply_off": 28,
    "dx.high_limit_switch_open_furnace_overheat": 29,
    "dx.igniter_or_pilot_failure": 30,
    "dx.insufficient_combustion_air_flame_rollout": 31,
    "dx.loose_or_corroded_wiring_connection": 32,
    "dx.main_power_switch_off": 33,
    "dx.non_condensable_gases_in_refrigerant": 34,
    "dx.outdoor_unit_damaged_coil_fins": 35,
    "dx.refrigerant_lines_kinked_or_wrong_size": 36,
    "dx.refrigerant_overcharge": 37,
    "dx.refrigerant_undercharge": 38,
    "dx.reversing_valve_stuck_or_leaking": 39,
    "dx.significant_duct_leakage_or_disconnection": 40,
    "dx.system_undersized_for_load_or_extreme_weather": 41,
    "dx.thermal_expansion_valve_stuck_or_failed": 42,
    "dx.thermostat_batteries_dead_or_no_power": 43,
    "dx.thermostat_off_user_error": 44,
    "dx.thermostat_sensor_miscalibrated_or_poor_location": 45,
    "dx.thermostat_set_incorrectly_mode_or_temp": 46,
    "dx.thermostat_unresponsive_or_malfunctioning": 47,
    "dx.thermostat_wiring_misconfigured_or_loose": 48,
    "dx.undersized_or_blocked_ducts_registers": 49,
    "dx.zone_damper_or_controller_malfunction": 50
  },
  "version": 1
}